results/cpu-vs-latency3/memcached/2-1/nsl201.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     1719598 ops,   56374 (avg:   57319) ops/sec, 2.13MB/sec (avg: 2.16MB/sec),  0.14 (avg:  0.14) msec latency

4         Threads
2         Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        5210.99          ---          ---      0.13900       386.28
Gets       52108.86     32364.29     19744.57      0.13600      1827.33
Totals     57319.85     32364.29     19744.57      0.13600      2213.61


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET        -nan    100.00000
---
GET       0.050      0.00013
GET       0.051      0.00045
GET       0.052      0.00083
GET       0.053      0.00147
GET       0.054      0.00365
GET       0.055      0.00672
GET       0.056      0.01203
GET       0.057      0.01970
GET       0.058      0.02955
GET       0.059      0.04414
GET       0.060      0.06339
GET       0.061      0.08776
GET       0.062      0.11751
GET       0.063      0.15154
GET       0.064      0.19466
GET       0.065      0.24705
GET       0.066      0.30635
GET       0.067      0.37639
GET       0.068      0.45328
GET       0.069      0.54137
GET       0.070      0.64359
GET       0.071      0.75355
GET       0.072      0.87631
GET       0.073      1.00635
GET       0.074      1.15802
GET       0.075      1.32844
GET       0.076      1.50601
GET       0.077      1.70924
GET       0.078      1.93243
GET       0.079      2.18056
GET       0.080      2.45403
GET       0.081      2.75877
GET       0.082      3.09697
GET       0.083      3.47970
GET       0.084      3.91085
GET       0.085      4.39893
GET       0.086      4.98904
GET       0.087      5.67625
GET       0.088      6.50483
GET       0.089      7.46519
GET       0.090      8.60204
GET       0.091      9.91999
GET       0.092     11.47404
GET       0.093     13.56050
GET       0.094     16.71294
GET       0.095     21.06261
GET       0.096     25.23873
GET       0.097     28.29374
GET       0.098     30.70209
GET       0.099     32.83820
GET       0.100     41.48265
GET       0.110     51.65762
GET       0.120     58.09413
GET       0.130     63.31857
GET       0.140     70.67726
GET       0.150     77.22508
GET       0.160     80.43989
GET       0.170     82.84312
GET       0.180     84.87374
GET       0.190     87.64614
GET       0.200     89.69422
GET       0.210     90.76371
GET       0.220     91.57016
GET       0.230     92.35576
GET       0.240     93.46823
GET       0.250     94.37333
GET       0.260     94.97572
GET       0.270     95.45625
GET       0.280     95.94689
GET       0.290     96.53073
GET       0.300     96.99258
GET       0.310     97.34658
GET       0.320     97.62120
GET       0.330     97.87042
GET       0.340     98.11645
GET       0.350     98.32882
GET       0.360     98.51337
GET       0.370     98.68097
GET       0.380     98.84466
GET       0.390     99.02358
GET       0.400     99.16662
GET       0.410     99.28323
GET       0.420     99.38187
GET       0.430     99.47367
GET       0.440     99.56086
GET       0.450     99.63244
GET       0.460     99.68655
GET       0.470     99.73268
GET       0.480     99.77163
GET       0.490     99.80989
GET       0.500     99.83880
GET       0.510     99.86125
GET       0.520     99.87884
GET       0.530     99.89202
GET       0.540     99.90763
GET       0.550     99.91870
GET       0.560     99.92810
GET       0.570     99.93725
GET       0.580     99.94441
GET       0.590     99.95158
GET       0.600     99.95701
GET       0.610     99.96149
GET       0.620     99.96495
GET       0.630     99.96789
GET       0.640     99.97077
GET       0.650     99.97307
GET       0.660     99.97582
GET       0.670     99.97934
GET       0.680     99.98177
GET       0.690     99.98382
GET       0.700     99.98535
GET       0.710     99.98663
GET       0.720     99.98785
GET       0.730     99.98893
GET       0.740     99.98964
GET       0.750     99.99060
GET       0.760     99.99136
GET       0.770     99.99168
GET       0.780     99.99200
GET       0.790     99.99220
GET       0.800     99.99239
GET       0.810     99.99258
GET       0.820     99.99316
GET       0.830     99.99360
GET       0.840     99.99399
GET       0.850     99.99424
GET       0.860     99.99469
GET       0.880     99.99501
GET       0.890     99.99514
GET       0.900     99.99539
GET       0.910     99.99546
GET       0.920     99.99559
GET       0.930     99.99565
GET       0.940     99.99578
GET       0.950     99.99591
GET       0.970     99.99603
GET       0.980     99.99610
GET       1.000     99.99661
GET       1.100     99.99680
GET       1.200     99.99731
GET       1.300     99.99744
GET       1.400     99.99776
GET       1.500     99.99789
GET       1.600     99.99814
GET       1.700     99.99853
GET       1.800     99.99866
GET       1.900     99.99878
GET       2.000     99.99885
GET       2.100     99.99891
GET       2.200     99.99904
GET       2.300     99.99923
GET       2.400     99.99936
GET       2.500     99.99942
GET       3.000     99.99949
GET       3.100     99.99955
GET       3.500     99.99962
GET       4.100     99.99974
GET       4.200     99.99981
GET       4.300     99.99987
GET       5.000     99.99994
GET       5.100    100.00000